{
    "First name": "John",
    "Last name": "Doe",
    "Year in school": 3,
    "Birth year": 2003,
    "Email": "john.doe@email.com",
    "Resume raw text": "John Doe\n123 Main Street\nAnytown, USA\n(555) 123-4567\njohn.doe@email.com\n\nObjective:\nPassionate and dedicated Computer Science major seeking internship opportunities to apply knowledge in software development and contribute to innovative projects in the field.\n\nEducation:\nBachelor of Science in Computer Science\nUniversity of Anytown, Anytown, USA\nExpected Graduation: May 20XX\n\nRelevant Coursework:\n- Introduction to Computer Science\n- Data Structures and Algorithms\n- Database Management Systems\n- Object-Oriented Programming\n- Web Development\n- Operating Systems\n- Software Engineering\n\nSkills:\nProgramming Languages: Java, Python, C++\nWeb Technologies: HTML, CSS, JavaScript\nDatabase Management: SQL, MySQL\nOperating Systems: Windows, Linux\nSoftware Tools: Git, IntelliJ IDEA, Eclipse\n\nExperience:\nSoftware Developer Intern\nXYZ Tech, Anytown, USA\nJune 20XX - August 20XX\n- Developed new features for the company's web application using Java, HTML, CSS, and JavaScript.\n- Collaborated with the development team to troubleshoot and debug software issues.\n- Assisted in database management tasks, including data migration and optimization.\n\nProjects:\nOnline Bookstore Web Application\n- Developed a fully functional online bookstore using Java servlets and JSP for dynamic web content.\n- Implemented user authentication and authorization features using session management and encryption techniques.\n- Integrated a MySQL database to store and manage product information, user data, and order history.\n\nHackathon Project: Campus Navigation App\n- Led a team of four to develop a mobile app to help students navigate the university campus.\n- Utilized Google Maps API for location tracking and route planning.\n- Implemented a user-friendly interface with real-time updates on campus events and resources.\n\nLeadership and Activities:\nPresident, Computer Science Club\n- Organized workshops and guest lectures on emerging technologies and industry trends.\n- Facilitated networking opportunities for club members with professionals in the tech industry.\n\nMember, Association for Computing Machinery (ACM)\n- Participated in coding competitions and hackathons to enhance coding skills and problem-solving abilities.\n\nLanguages:\nEnglish (Native)\nSpanish (Conversational)"
  }
  